DataProcessors/Renault_ЗагрузкаРеферансовЧерезWS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ЗагрузкаРеферансовЧерезWS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PCLПродажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PNCЗакупСкладская</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PNCЗакупСрочная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейИзменения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьНаборами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_СкидкиОптовыеРеферансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СкидкиОптовыеРеферансы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкладской</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСрочный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТарифЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаТарифа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_КаталогРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КаталогРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехСемья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Габариты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеВSAPе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодоваяЗапчасть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PVI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыPVI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_КомментарииРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КомментарииРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЗаменыРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЗаменыРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АртикулНоменклатуры</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Замены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Замены</Name>
			<Comment>Замены</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество замены</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗамены</Name>
					<Comment>Дата замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>Дата обновления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер по каталогу номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>Номер по каталогу номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Номер для поиска по каталогу номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗаменыДляПоиска</Name>
					<Comment>Номер для поиска по каталогу номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ЗагрузкаРеферансовЧерезWS/Ext/ObjectModule.bsl
Перем Форма Экспорт;

Функция ПолучитьВебСервис() Экспорт
	
	ДанныеПодключения = Справочники.Renault_ПараметрыПодключенияКСервисам.ПолучитьПараметрыПодключенияПоСсылке(
		Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate,
		"ReclamationsData.ws");
	Адрес = ДанныеПодключения.Адрес;
	ЛогинWS = ДанныеПодключения.Логин;
	ПарольWS = ДанныеПодключения.Пароль;
	
	WSОпределение = Новый WSОпределения(
		СокрЛП(Адрес),
		СокрЛП(ЛогинWS),
		СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(
		WSОпределение, 
		"http://renault-nissan.com/schema/nomen", 
		"Renault_ReclamationsData", 
		"Renault_ReclamationsDataSoap", 
		3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
КонецФункции

Процедура ОбработкаНаСервере() Экспорт
	
	ПолучитьДанные();
	
КонецПроцедуры // ОбработкаНаСервере()

Функция ПолучитьМассивБирДляПолученияДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CRM_ДилерскиеЦентры.BIR
	               |ИЗ
	               |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры";
	МассивБИР = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("BIR");
	Возврат МассивБИР;
	
КонецФункции

Функция ЗарегистрироватьИзменения() Экспорт
	
	ВебСервис = ПолучитьВебСервис();
	
	НомерСообщения = Константы.Renault_НомерСообщения.Получить();
	ИдентификаторДилера = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	УдалениеУспешно = ВебСервис.DelMSG(ИдентификаторДилера, Константы.Renault_НомерСообщения.Получить());
	Если УдалениеУспешно Тогда
		Константы.Renault_НомерСообщения.Установить(Константы.Renault_НомерСообщения.Получить()+1);
		//Сообщить("Удалили регистрацию, новый номер "+Константы.Renault_НомерСообщения.Получить());
	Иначе
		//Сообщить("Бир не зарегистрирован");
	КонецЕсли;
	НомерСообщения = Константы.Renault_НомерСообщения.Получить();
	
КонецФункции

Процедура ПолучитьДанные() Экспорт

    Возврат; //Временно не пользуемся загрузкой

    ВебСервис = ПолучитьВебСервис();

    ИдентификаторДилера = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
    ТаблицаДанныхXDTO = ВебСервис.Get(ИдентификаторДилера, НомерСообщения, 0);
    Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
    ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ТаблицаДанныхXDTO);

    Если ТаблицаДанных.Количество() > 0 Тогда
        ЗаписьВРегистры(ТаблицаДанных);
        //Сообщить("Успешно забрали и записали " + ТаблицаДанных.str.Количество() + " записей");
    Иначе
        //Сообщить("Нет изменений в ЦИБ");
    КонецЕсли;

    ЗарегистрироватьИзменения();

КонецПроцедуры // ПолучитьДанные()

Процедура ЗаписьВРегистры(ТаблицаДанных)
	ТаблицаЦен = Новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Артикул");
	ТаблицаЦен.Колонки.Добавить("ТипЦены");
	ТаблицаЦен.Колонки.Добавить("Цена");
	ТаблицаЦен.Колонки.Добавить("ДатаНачала");
	
	Для каждого СтрокаРезультата из ТаблицаДанных Цикл
		Если СтрокаРезультата.ТипДанных = "Номенклатура" Тогда
			 ДобавитьКаталогРеферансы(СтрокаРезультата);
		ИначеЕсли СтрокаРезультата.ТипДанных = "ЦеныНаРеферансы" Тогда
			 ДобавитьТарифЦен(СтрокаРезультата, ТаблицаЦен);
		ИначеЕсли СтрокаРезультата.ТипДанных = "ЗаменыНоменклатуры" Тогда
			 ДобавитьЗаменыРеферансов(СтрокаРезультата);
		ИначеЕсли СтрокаРезультата.ТипДанных = "Комментарий" Тогда
			 ДобавитьКомментарий (СтрокаРезультата);
		 ИначеЕсли СтрокаРезультата.ТипДанных = "Скидки" Тогда
			 ДобаыитьСкидкиНаРеферансы (СтрокаРезультата);
		КонецЕсли;
	КонецЦикла;
	ОбработатьТаблицуЦен(ТаблицаЦен);
КонецПроцедуры

Процедура ДобаыитьСкидкиНаРеферансы (СтрокаРезультата)
	Менеджер = РегистрыСведений.Renault_СкидкиОптовыеРеферансы.СоздатьМенеджерЗаписи();
	Менеджер.КодСкидки = СтрокаРезультата.ТипСкидкиКод;
	Менеджер.ПроцентСкладской = СтрокаРезультата.СкидкаСкладской;
	Менеджер.ПроцентСрочный = СтрокаРезультата.СкидкаСрочный;
	Менеджер.Записать();
КонецПроцедуры

Процедура ОбработатьТаблицуЦен (ТаблицаЦен)
	
	Для Каждого СтрокаТЗ из ТаблицаЦен Цикл
		МенеджерЗаписи = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Артикул = СтрокаТЗ.Артикул;
		МенеджерЗаписи.ТипЦены = СтрокаТЗ.ТипЦены;
		МенеджерЗаписи.Прочитать();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЗ);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	ТаблицаЦенPCL = ТаблицаЦен.Скопировать(Новый Структура("ТипЦены", Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенPCL));
	ТаблицаЦенPNCСкладская = ТаблицаЦен.Скопировать(Новый Структура("ТипЦены", Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенPNC));
	ТаблицаЦенPNCСрочная = ТаблицаЦен.Скопировать(Новый Структура("ТипЦены", Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенPNCU));
	
	Если ТаблицаЦенPCL.Количество() > 0 Тогда
		СоздатьПереоценкуНоменклатуры (ТаблицаЦенPCL, Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенPCL);
	КонецЕсли;
	Если ТаблицаЦенPNCСкладская.Количество() > 0 Тогда
		СоздатьПереоценкуНоменклатуры (ТаблицаЦенPNCСкладская, Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенPNC);
	КонецЕсли;
	Если ТаблицаЦенPNCСрочная.Количество() > 0 Тогда
		СоздатьПереоценкуНоменклатуры (ТаблицаЦенPNCСрочная, Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенPNCU);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьПереоценкуНоменклатуры (ТаблицаЦен, ТипЦены)
	перем Период, ИзменениеЦенОбъект;
	ТаблицаЦен.Сортировать("ДатаНачала");
	Для Каждого СтрокаТЗ из ТаблицаЦен Цикл
		Если Период <> СтрокаТЗ.ДатаНачала Тогда
			Период = СтрокаТЗ.ДатаНачала;
			Если ИзменениеЦенОбъект <> Неопределено Тогда
				Если ИзменениеЦенОбъект.Товары.Количество() > 0 Тогда
					Попытка 
						ИзменениеЦенОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ИзменениеЦенОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки; 
				КонецЕсли;
			КонецЕсли;
			ИзменениеЦенОбъект = Документы.ИзменениеЦен.СоздатьДокумент();
			ИзменениеЦенОбъект.ХозОперация = Справочники.ХозОперации.УстановкаЦенКонтрагента;
			ИзменениеЦенОбъект.ТипЦен = ТипЦены;
			ИзменениеЦенОбъект.Контрагент = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОсновнойПоставщик;
			ИзменениеЦенОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			ИзменениеЦенОбъект.Организация = ПараметрыСеанса.Организация;
			ИзменениеЦенОбъект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
			ИзменениеЦенОбъект.ПодразделениеКомпанииПолучатель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
			ИзменениеЦенОбъект.ДатаНачалаДействия = Период; 
			ИзменениеЦенОбъект.Дата = Период;
			ИзменениеЦенОбъект.Автор = ПараметрыСеанса.Пользователь;
			ИзменениеЦенОбъект.КурсДокумента = 1; 
			ИзменениеЦенОбъект.УстановитьНовыйНомер();
			
		КонецЕсли;
		Номенклатура = НайтиНоменклатуру(СтрокаТЗ.Артикул);
		Если Номенклатура = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = ИзменениеЦенОбъект.Товары.Добавить();
		СтрокаТЧ.Номенклатура = Номенклатура;
		СтрокаТЧ.Цена = СтрокаТЗ.Цена;
		СтрокаТЧ.ЕдиницаИзмерения = СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения;
		СтрокаТЧ.Коэффициент = 1;
	КонецЦикла;
	Если ИзменениеЦенОбъект <> Неопределено и ИзменениеЦенОбъект.ЭтоНовый() Тогда
		Если ИзменениеЦенОбъект.Товары.Количество() > 0 Тогда
			Попытка 
				ИзменениеЦенОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ИзменениеЦенОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКаталогРеферансы(СтрокаРезультата)
	Если Не ЗначениеЗаполнено(СтрокаРезультата.АртикулНоменклатура) Тогда
		Возврат;
	КонецЕсли;
	
	//Сегмент = Справочники.Renault_Сегменты.ПустаяСсылка();
	ТекущаяДата = ТекущаяДата();
	Родитель = Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.КаталогRenault;
	ГруппаСегмент = Родитель;
	Если ЗначениеЗаполнено(СтрокаРезультата.СегментСсылка) Тогда
		ГруппаСегмент = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаРезультата.СегментСсылка));
		ГруппаСегментОбъект = ГруппаСегмент.ПолучитьОбъект();
		Если ГруппаСегментОбъект = Неопределено Тогда
			ГруппаСегментОбъект = Справочники.Номенклатура.СоздатьГруппу();
			ГруппаСегментОбъект.УстановитьСсылкуНового(ГруппаСегмент);
			ЗаполнитьЗначенияСвойств(ГруппаСегментОбъект, Родитель,"ТипНоменклатуры,ВидНоменклатуры,СтавкаНДС,ВалютаУчета");
			ГруппаСегментОбъект.Наименование = СтрокаРезультата.СегментКод + "_" + СтрокаРезультата.СегментНаименование;
			ГруппаСегментОбъект.Родитель = Родитель;
			ГруппаСегментОбъект.УстановитьНовыйКод();
			ГруппаСегментОбъект.Записать();
		КонецЕсли;
		Сегмент = Справочники.Renault_Сегменты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаРезультата.СегментСсылка));
		СегментОбъект = Сегмент.ПолучитьОбъект();
		Если СегментОбъект = Неопределено Тогда
			СегментОбъект = Справочники.Renault_Сегменты.СоздатьЭлемент();
			СегментОбъект.УстановитьСсылкуНового(Сегмент);
			СегментОбъект.Наименование = СтрокаРезультата.СегментНаименование;
			СегментОбъект.Код = СтрокаРезультата.СегментКод;
			Попытка
				СегментОбъект.Записать();
			Исключение
			КонецПопытки;
		Иначе
			СегментОбъект.Наименование = СтрокаРезультата.СегментНаименование;
			СегментОбъект.Код = СтрокаРезультата.СегментКод;
			Попытка
				СегментОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	НоменклатураСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаРезультата.АртикулНоменклатура); 
	Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		НоменклатураОбъект.Наименование = ?(СтрокаРезультата.АртикулЗамена= "",СтрокаРезультата.АртикулНоменклатура,СтрокаРезультата.АртикулЗамена);
		НоменклатураОбъект.НаименованиеИностранное = ?(СтрокаРезультата.АртикулЗамена= "",СтрокаРезультата.АртикулНоменклатура,СтрокаРезультата.АртикулЗамена);
		НоменклатураОбъект.НаименованиеПолное = ?(СтрокаРезультата.АртикулЗамена= "",СтрокаРезультата.АртикулНоменклатура,СтрокаРезультата.АртикулЗамена);
		НоменклатураОбъект.Артикул = СтрокаРезультата.АртикулНоменклатура;
		НоменклатураОбъект.ТипНоменклатуры = Родитель.ТипНоменклатуры;
		НоменклатураОбъект.ВидНоменклатуры = Родитель.ВидНоменклатуры;
		НоменклатураОбъект.БазоваяЕдиницаИзмерения = Родитель.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
		НоменклатураОбъект.СтавкаНДС = Родитель.СтавкаНДС;
		Если НоменклатураОбъект.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 2 Тогда
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ЕдиницаИзмерения,
								Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Родитель.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения.Наименование,,,Родитель.ТипНоменклатуры));
			ЕдиницаИзмерения.Владелец = НоменклатураСсылка;
			ЕдиницаИзмерения.УстановитьНовыйКод();
			ЕдиницаИзмерения.Записать();
		Иначе
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Родитель.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения.Наименование,,,Родитель.ТипНоменклатуры);
		КонецЕсли;
		НоменклатураОбъект.ОсновнаяЕдиницаИзмерения = ЕдиницаИзмерения;
		НоменклатураОбъект.ВалютаУчета = Родитель.ВалютаУчета;
		НоменклатураОбъект.Родитель = ГруппаСегмент;
		НоменклатураОбъект.УстановитьНовыйКод();
	Иначе
		НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
	КонецЕсли;
	НоменклатураОбъект.КратностьПоставок = СтрокаРезультата.КратностьЗаказа;
	НоменклатураОбъект.ЗапретЗакупки = СтрокаРезультата.ЗапретЗакупки;
	Попытка
		НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
		НоменклатураОбъект.Записать();   
	Исключение
		Возврат;
	КонецПопытки;
	Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		НоменклатураСсылка = НоменклатураОбъект.Ссылка;
	КонецЕсли;
	
	НовЗаписьСрез = РегистрыСведений.Renault_КаталогРеферансов.СоздатьМенеджерЗаписи();
		
	НовЗаписьСрез.Номенклатура = НоменклатураСсылка;
	НовЗаписьСрез.Артикул = СтрокаРезультата.АртикулНоменклатура;
	НовЗаписьСрез.Прочитать();
	
	Если НЕ НовЗаписьСрез.Выбран() Тогда
		НовЗаписьСрез.Номенклатура = НоменклатураСсылка;
		НовЗаписьСрез.Артикул = СтрокаРезультата.АртикулНоменклатура;
	КонецЕсли;
	
	НовЗаписьСрез.КратностьПоставок = СтрокаРезультата.КратностьЗаказа;
	НовЗаписьСрез.ЗапретЗакупки = СтрокаРезультата.ЗапретЗакупки;
	НовЗаписьСрез.НаличиеВSAPе = СтрокаРезультата.НаличиеВSAP;
	НовЗаписьСрез.ТехСемья = СтрокаРезультата.ТехСемья;
	НовЗаписьСрез.Артикул = СтрокаРезультата.АртикулНоменклатура;
	НовЗаписьСрез.Наименование = СтрокаРезультата.АртикулЗамена;
	НовЗаписьСрез.Нетто = СтрокаРезультата.ВесНетто;
	НовЗаписьСрез.Брутто = СтрокаРезультата.ВесБрутто;
	НовЗаписьСрез.Объем = СтрокаРезультата.Объем;
	НовЗаписьСрез.Сегмент = Сегмент;
	НовЗаписьСрез.КодСкидки = СтрокаРезультата.ТипСкидкиКод;
	НовЗаписьСрез.Габариты = СтрокаРезультата.Размер;
	НовЗаписьСрез.ПрямаяПоставка		= СтрокаРезультата.ПрямаяПоставка;
	НовЗаписьСрез.КодоваяЗапчасть		= СтрокаРезультата.КодоваяЗапчасть;
	НовЗаписьСрез.PVI					= ?(ЗначениеЗаполнено(СтрокаРезультата.PVI),Перечисления.Renault_ТипыPVI[СтрокаРезультата.PVI],
												Перечисления.Renault_ТипыPVI.ПустаяСсылка());

	НовЗаписьСрез.Записать();
	
	ДляУдаленияКомментов = РегистрыСведений.Renault_КомментарииРеферансов.СоздатьНаборЗаписей();
	
	ДляУдаленияКомментов.Отбор.Номенклатура.Установить(НоменклатураСсылка);
	ДляУдаленияКомментов.Записать();
	
КонецПроцедуры

Процедура СохранитьВРегистреИстории (СтрокаЗаписи, ИмяРегистра)
	
	СтрокаИстории = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(СтрокаИстории, СтрокаЗаписи);
	СтрокаИстории.Период = ТекущаяДата();
	СтрокаИстории.Записать();
	
КонецПроцедуры

Процедура ДобавитьКомментарий(СтрокаРезультата)
	
	НоменклатураСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаРезультата.АртикулНоменклатура); 
	Если НоменклатураСсылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда
		НовЗапись				= РегистрыСведений.Renault_КомментарииРеферансов.СоздатьМенеджерЗаписи();
		НовЗапись.Номенклатура = НоменклатураСсылка;
		НовЗапись.Комментарий	= СтрокаРезультата.АртикулЗамена;
		НовЗапись.Прочитать();
		НовЗапись.Номенклатура = НоменклатураСсылка;
		НовЗапись.Артикул		= СтрокаРезультата.АртикулНоменклатура;
		НовЗапись.Комментарий	= СтрокаРезультата.АртикулЗамена;
		НовЗапись.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗаменыРеферансов(СтрокаРезультата)
	
	ТекущаяДата = ТекущаяДата();
	Если СтрокаРезультата.УдалитьСтроку = Истина Тогда
		ДляУдаленияЗамены = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьМенеджерЗаписи();
		ДляУдаленияЗамены.АртикулНоменклатуры = СтрокаРезультата.АртикулНоменклатура;
		ДляУдаленияЗамены.АртикулЗамены = СтрокаРезультата.АртикулЗамена;
		ДляУдаленияЗамены.Прочитать();
		ДляУдаленияЗамены.Удалить();
		ДляУдаление = РегистрыСведений.Замены.СоздатьМенеджерЗаписи();
		ДляУдаление.Артикул = СтрокаРезультата.АртикулНоменклатура;
		ДляУдаление.АртикулЗамены = СтрокаРезультата.АртикулЗамена;
		ДляУдаление.Прочитать();
		ДляУдаление.Удалить();
	Иначе
		НовЗаписьСрез = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьМенеджерЗаписи();
		НовЗаписьСрез.АртикулНоменклатуры		= СтрокаРезультата.АртикулНоменклатура;
		НовЗаписьСрез.АртикулЗамены             = СтрокаРезультата.АртикулЗамена;
		НовЗаписьСрез.Прочитать();
		// TODO: Убрать ошметки от удаления сохранения истории
		ЗаполнитьЗначенияСвойств(НовЗаписьСрез, СтрокаРезультата);
		НовЗаписьСрез.АртикулНоменклатуры		= СтрокаРезультата.АртикулНоменклатура;
		НовЗаписьСрез.АртикулЗамены             = СтрокаРезультата.АртикулЗамена;
		НовЗаписьСрез.ДатаНачала				= ТекущаяДата;
		НовЗаписьСрез.Записать();
		ЗаписьЗамены = РегистрыСведений.Замены.СоздатьМенеджерЗаписи();
		ЗаписьЗамены.Артикул = СтрокаРезультата.АртикулНоменклатура;
		ЗаписьЗамены.АртикулЗамены = СтрокаРезультата.АртикулЗамена;
		ЗаписьЗамены.ДатаЗамены = ТекущаяДата;
		ЗаписьЗамены.ДатаОбновления = ТекущаяДата;
		ЗаписьЗамены.Количество = 1;
		ЗаписьЗамены.ЗапретИзменения = Истина;  
		ЗаписьЗамены.ДатаЗавершения = СтрокаРезультата.ДатаЗавершения;
		ЗаписьЗамены.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьТарифЦен(СтрокаРезультата, ТаблицаЦен)

	Прайс = НайтиПрайсПоЦене(СтрокаРезультата.ТипЦены);
	Если СтрокаРезультата.УдалитьСтроку = Неопределено ИЛИ СтрокаРезультата.УдалитьСтроку = Ложь Тогда
		СтрокаТЗ = ТаблицаЦен.Добавить();
		СтрокаТЗ.Артикул = СтрокаРезультата.АртикулНоменклатура;
		СтрокаТЗ.ТипЦены = Прайс;
		СтрокаТЗ.Цена = СтрокаРезультата.Цена;
		СтрокаТЗ.ДатаНачала = СтрокаРезультата.ДатаНачала;
	Иначе
		МенеджерТарифа = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
		МенеджерТарифа.Артикул = СтрокаРезультата.АртикулНоменклатура;
		МенеджерТарифа.ТипЦены = Прайс;
		МенеджерТарифа.Прочитать();
		МенеджерТарифа.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиНоменклатуру(Артикул)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_КаталогРеферансов.Номенклатура 
	                      |ИЗ
	                      |	РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
	                      |ГДЕ
	                      |	Renault_КаталогРеферансов.Артикул = &Артикул");
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Номенклатура; 
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция НайтиПрайсПоЦене(ИмяТипаЦены)
	
	Если ИмяТипаЦены = "PCL" Тогда Возврат PCLПродажа; КонецЕсли;
	Если ИмяТипаЦены = "PNCStore" Тогда Возврат PNCЗакупСкладская; КонецЕсли;
	Если ИмяТипаЦены = "PNCQuick" Тогда Возврат PNCЗакупСрочная; КонецЕсли;
	Возврат Неопределено;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// API 2.0
////////////////////////////////////////////////////////////////////////////////

Процедура Статус(Текст="", Процент=0)
    Если Форма = Неопределено Тогда Возврат КонецЕсли;
    #Если Клиент Тогда
        Форма.Статус(Текст, Процент);
    #КонецЕсли
КонецПроцедуры

Функция ПолучитьPVI(PVI)

    Если PVI = "PVI" Тогда
        Возврат Перечисления.Renault_ТипыPVI.PVI;
    ИначеЕсли PVI = "Не PVI" Тогда
        Возврат Перечисления.Renault_ТипыPVI.НеPVI;
    Иначе
        Возврат Перечисления.Renault_ТипыPVI.ПустаяСсылка();
    КонецЕсли;

КонецФункции

Функция ПолучитьТипЦены(ИмяТипаЦены)

    Имя = НРег(ИмяТипаЦены);
    Если      Имя = "pcl"           Тогда Возврат PCLПродажа;
    ИначеЕсли Имя = "pnc складская" Тогда Возврат PNCЗакупСкладская;
    ИначеЕсли Имя = "pnc срочная"   Тогда Возврат PNCЗакупСрочная;
    Иначе Возврат Справочники.ТипыЦен.ПустаяСсылка(); КонецЕсли;

КонецФункции


// КАТАЛОГ

Процедура ЗагрузитьКаталог() Экспорт

    Статус("Получаем каталог с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьПолныйКаталогССервера();

    Если ЗаписыватьНаборами Тогда

        НаборЗаписей = РегистрыСведений.Renault_КаталогРеферансов.СоздатьНаборЗаписей();
        Счетчик = 0;
        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Читаем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            Счетчик = Счетчик + 1;
            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Если Не ЗначениеЗаполнено(Реф.Артикул) Тогда
                Продолжить;
            КонецЕсли;

            Стр = НаборЗаписей.Добавить();
            ЗаполнитьЗначенияСвойств(Стр, Реф);
            Стр.PVI           = ПолучитьPVI(Реф.PVI);
            Стр.Сегмент       = Справочники.Renault_Сегменты.НайтиПоКоду(Реф.Сегмент);
            Стр.Номенклатура  = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Стр.Артикул);
            Стр.ПолныйАртикул = Прав("0000000000" + СокрЛП(Стр.Артикул), 10);

            Если Счетчик >= КоличествоОбъектов Тогда
                Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
                НаборЗаписей.Записать(Ложь);
                НаборЗаписей = РегистрыСведений.Renault_КаталогРеферансов.СоздатьНаборЗаписей();
                Счетчик = 0;
                Статус("Читаем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
            КонецЕсли;

        КонецЦикла;

        Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
        НаборЗаписей.Записать(Ложь);

    Иначе

        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Записываем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Если Не ЗначениеЗаполнено(Реф.Артикул) Тогда
                Продолжить;
            КонецЕсли;

            Стр = РегистрыСведений.Renault_КаталогРеферансов.СоздатьМенеджерЗаписи();
            ЗаполнитьЗначенияСвойств(Стр, Реф);
            Стр.PVI           = ПолучитьPVI(Реф.PVI);
            Стр.Сегмент       = Справочники.Renault_Сегменты.НайтиПоКоду(Реф.Сегмент);
            Стр.Номенклатура  = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Стр.Артикул);
            Стр.ПолныйАртикул = Прав("0000000000" + СокрЛП(Стр.Артикул), 10);

            Стр.Записать(Истина);

        КонецЦикла;

    КонецЕсли;

    Статус("Каталог загружен", 100);

КонецПроцедуры

Процедура ОбновитьКаталог(Интервал) Экспорт

    Статус("Получаем изменения каталог с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьИзмененияКаталогаССервера(Интервал);

    ГлобальныйСчетчик = 0;
    ВсегоЗаписей = Таблица.Количество();

    Статус("Записываем данные");

    Для Каждого Реф Из Таблица Цикл

        #Если Клиент Тогда
            ОбработкаПрерыванияПользователя();
        #КонецЕсли

        ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
        Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

        Если Не ЗначениеЗаполнено(Реф.Артикул) Тогда
            Продолжить;
        КонецЕсли;

        Стр = РегистрыСведений.Renault_КаталогРеферансов.СоздатьМенеджерЗаписи();
        ЗаполнитьЗначенияСвойств(Стр, Реф);
        Стр.PVI          = ПолучитьPVI(Реф.PVI);
        Стр.Сегмент      = Справочники.Renault_Сегменты.НайтиПоКоду(Реф.Сегмент);
        Стр.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Стр.Артикул);

        Стр.Записать(Истина);

    КонецЦикла;

    Статус("Изменения каталога загружены", 100);

КонецПроцедуры

Процедура ОчиститьКаталог() Экспорт

    Статус("Очистка каталога", 50);

    Каталог = РегистрыСведений.Renault_КаталогРеферансов.СоздатьНаборЗаписей();
    Каталог.Записать();

    Статус("Каталог очищен", 100);

КонецПроцедуры


Процедура ЗагрузитьСегменты() Экспорт

    Статус("Получаем каталог с сервера");

    ВебСервис = ЭтотОбъект.ПолучитьВебСервис();
    Хранилище = ВебСервис.GetSegments();

    Статус("Обрабатываем полученный файл");

    ДвДанные = Хранилище.Получить();
    ИмяФайла = ПолучитьИмяВременногоФайла(".xml");
    ДвДанные.Записать(ИмяФайла);

    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ИмяФайла);

    Статус("Читаем файл");

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.Имя = "Сегменты" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            ЧтениеXML.Прочитать();
            Рез = ПрочитатьXML(ЧтениеXML);
            Таблица = Рез.Получить();

            ГлобальныйСчетчик = 0;
            ВсегоЗаписей = Таблица.Количество();

            Статус("Читаем данные");

            Для Каждого Сег Из Таблица Цикл

                #Если Клиент Тогда
                    ОбработкаПрерыванияПользователя();
                #КонецЕсли

                Сегмент = Справочники.Renault_Сегменты.НайтиПоКоду(Сег.Код);

                Если Не ЗначениеЗаполнено(Сегмент) Тогда // Создаем новый
                    Сегмент = Справочники.Renault_Сегменты.СоздатьЭлемент();
                    Сегмент.Код = Сег.Код;
                Иначе
                    Сегмент = Сегмент.ПолучитьОбъект();
                КонецЕсли;

                Сегмент.Наименование = Сег.Наименование;

                ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
                Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

                Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
                Сегмент.Записать();

                Статус("Читаем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);

            КонецЦикла;

        КонецЕсли;

    КонецЦикла;

    ЧтениеXML.Закрыть();

    Статус("Очищаем временные файлы", 100);

    УдалитьФайлы(ИмяФайла);

    Статус("Сегменты обновлены", 100);
    
КонецПроцедуры


// ТАРИФ

Функция ПолучитьИсториюЦенССервера(Артикул)

    ВебСервис = ПолучитьВебСервис();
    Хранилище = ВебСервис.GetPriceHistory(BIR, Артикул);

    Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
    Таблица = Сериализатор.ПрочитатьXDTO(Хранилище);

    Возврат Таблица;

КонецФункции


Процедура ЗагрузитьТариф() Экспорт

    Статус("Получаем тариф с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьПолныйТарифССервера(BIR);

    Если ЗаписыватьНаборами Тогда

        НаборЗаписей = РегистрыСведений.Renault_ТарифЦен.СоздатьНаборЗаписей();
        Счетчик = 0;
        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Читаем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            Счетчик = Счетчик + 1;
            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Стр = НаборЗаписей.Добавить();
            Стр.Артикул    = Реф.Артикул;
            Стр.Цена       = Реф.Цена;
            Стр.ДатаТарифа = Реф.Период;
            Стр.ТипЦены    = Справочники.ТипыЦен.НайтиПоНаименованию(Реф.ТипЦены);
            Стр.КодВалюты  = "RUB";

            Если Счетчик >= КоличествоОбъектов Тогда
                Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
                НаборЗаписей.Записать(Ложь);
                НаборЗаписей = РегистрыСведений.Renault_ТарифЦен.СоздатьНаборЗаписей();
                Счетчик = 0;
                Статус("Читаем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
            КонецЕсли;

        КонецЦикла;

        Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
        НаборЗаписей.Записать(Ложь);

    Иначе

        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Записываем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли

            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Стр = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
            Стр.Артикул    = Реф.Артикул;
            Стр.Цена       = Реф.Цена;
            Стр.ДатаТарифа = Реф.Период;
            Стр.ТипЦены    = Справочники.ТипыЦен.НайтиПоНаименованию(Реф.ТипЦены);
            Стр.КодВалюты  = "RUB";

            Стр.Записать(Истина);

        КонецЦикла;

    КонецЕсли;

    Статус("Тариф загружен", 100);

КонецПроцедуры

Процедура ОбновитьТариф(Интервал) Экспорт

    Статус("Получаем изменения тарифа с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьИзмененияТарифаССервера(BIR, Интервал);

    ГлобальныйСчетчик = 0;
    ВсегоЗаписей = Таблица.Количество();

    Статус("Записываем данные");

    Для Каждого Реф Из Таблица Цикл

        #Если Клиент Тогда
            ОбработкаПрерыванияПользователя();
        #КонецЕсли

        ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
        Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

        Стр = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
        Стр.Артикул    = Реф.Артикул;
        Стр.Цена       = Реф.Цена;
        Стр.ДатаТарифа = Реф.Период;
        Стр.ТипЦены    = ПолучитьТипЦены(Реф.ТипЦены);
        Стр.КодВалюты  = "RUB";

        Стр.Записать(Истина);

    КонецЦикла;

    Статус("Изменения тарифа загружен", 100);

КонецПроцедуры

Процедура ОчиститьТариф() Экспорт

    Статус("Очистка тарифа", 50);

    Тариф = РегистрыСведений.Renault_ТарифЦен.СоздатьНаборЗаписей();
    Тариф.Записать();

    Статус("Тариф очищен", 100);

КонецПроцедуры

Процедура ЗагрузитьТарифВерсия2() Экспорт

    Статус("Получаем тариф с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьПолныйТарифССервераВерсия2(BIR);

    Если ЗаписыватьНаборами Тогда

        НаборЗаписей = РегистрыСведений.Renault_ТарифЦен.СоздатьНаборЗаписей();
        Счетчик = 0;
        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Читаем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            Счетчик = Счетчик + 1;
            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Если ЗначениеЗаполнено(Реф.PCL) Тогда
                Стр = НаборЗаписей.Добавить();
                Стр.Артикул    = Реф.Артикул;
                Стр.Цена       = Реф.PCL;
                Стр.ДатаТарифа = Реф.Период;
                Стр.ТипЦены    = PCLПродажа;
                Стр.КодВалюты  = "RUB";
            КонецЕсли;

            Если ЗначениеЗаполнено(Реф.PNC) Тогда
                Стр = НаборЗаписей.Добавить();
                Стр.Артикул    = Реф.Артикул;
                Стр.Цена       = Реф.PNC;
                Стр.ДатаТарифа = Реф.Период;
                Стр.ТипЦены    = PNCЗакупСкладская;
                Стр.КодВалюты  = "RUB";
            КонецЕсли;

            Если ЗначениеЗаполнено(Реф.PNCU) Тогда
                Стр = НаборЗаписей.Добавить();
                Стр.Артикул    = Реф.Артикул;
                Стр.Цена       = Реф.PNCU;
                Стр.ДатаТарифа = Реф.Период;
                Стр.ТипЦены    = PNCЗакупСрочная;
                Стр.КодВалюты  = "RUB";
            КонецЕсли;

            Если ЗаписыватьНаборами И Счетчик >= КоличествоОбъектов Тогда
                Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
                НаборЗаписей.Записать(Ложь);
                НаборЗаписей = РегистрыСведений.Renault_ТарифЦен.СоздатьНаборЗаписей();
                Счетчик = 0;
                Статус("Читаем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
            КонецЕсли;

        КонецЦикла;

        Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
        НаборЗаписей.Записать(Ложь);

    Иначе

        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Записываем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Если ЗначениеЗаполнено(Реф.PCL) Тогда
                Стр = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
                Стр.Артикул    = Реф.Артикул;
                Стр.Цена       = Реф.PCL;
                Стр.ДатаТарифа = Реф.Период;
                Стр.ТипЦены    = PCLПродажа;
                Стр.КодВалюты  = "RUB";
                Стр.Записать(Истина);
            КонецЕсли;

            Если ЗначениеЗаполнено(Реф.PNC) Тогда
                Стр = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
                Стр.Артикул    = Реф.Артикул;
                Стр.Цена       = Реф.PNC;
                Стр.ДатаТарифа = Реф.Период;
                Стр.ТипЦены    = PNCЗакупСкладская;
                Стр.КодВалюты  = "RUB";
                Стр.Записать(Истина);
            КонецЕсли;

            Если ЗначениеЗаполнено(Реф.PNCU) Тогда
                Стр = РегистрыСведений.Renault_ТарифЦен.СоздатьМенеджерЗаписи();
                Стр.Артикул    = Реф.Артикул;
                Стр.Цена       = Реф.PNCU;
                Стр.ДатаТарифа = Реф.Период;
                Стр.ТипЦены    = PNCЗакупСрочная;
                Стр.КодВалюты  = "RUB";
                Стр.Записать(Истина);
            КонецЕсли;

        КонецЦикла;

    КонецЕсли;

    Статус("Тариф загружен", 100);

КонецПроцедуры

Функция ПолучитьИсториюЦен(Артикул) Экспорт

    Возврат ПолучитьИсториюЦенССервера(Артикул);

КонецФункции


// ЗАМЕНЫ

Процедура ЗагрузитьЗамены() Экспорт

    Статус("Получаем замены с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьВсеЗаменыССервера(BIR);

    Если ЗаписыватьНаборами Тогда

        НаборЗаписей = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьНаборЗаписей();
        Счетчик = 0;
        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Читаем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            Счетчик = Счетчик + 1;
            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Стр = НаборЗаписей.Добавить();
            Стр.АртикулНоменклатуры = Реф.Артикул;
            Стр.АртикулЗамены       = Реф.АртикулЗамены;
            Стр.ДатаНачала          = Реф.ДатаНачала;
            Стр.ДатаЗавершения      = Реф.ДатаОкончания;

            Если Счетчик >= КоличествоОбъектов Тогда
                Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
                НаборЗаписей.Записать(Ложь);
                НаборЗаписей = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьНаборЗаписей();
                Счетчик = 0;
                Статус("Читаем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
            КонецЕсли;

        КонецЦикла;

        Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
        НаборЗаписей.Записать(Ложь);

    Иначе

        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Записываем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли

            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Стр = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьМенеджерЗаписи();
            Стр.АртикулНоменклатуры = Реф.Артикул;
            Стр.АртикулЗамены       = Реф.АртикулЗамены;
            Стр.ДатаНачала          = Реф.ДатаНачала;
            Стр.ДатаЗавершения      = Реф.ДатаОкончания;

            Стр.Записать(Истина);

        КонецЦикла;

    КонецЕсли;

    Статус("Замены загружены", 100);

КонецПроцедуры

Процедура ОбновитьЗамены(Интервал) Экспорт

    Статус("Получаем изменения замен с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьИзмененияЗаменССервера(BIR, Интервал);

    ГлобальныйСчетчик = 0;
    ВсегоЗаписей = Таблица.Количество();

    Статус("Записываем данные");

    Для Каждого Реф Из Таблица Цикл

        #Если Клиент Тогда
            ОбработкаПрерыванияПользователя();
        #КонецЕсли

        ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
        Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

        Стр = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьМенеджерЗаписи();
        Стр.АртикулНоменклатуры = Реф.АртикулНоменклатуры;
        Стр.АртикулЗамены       = Реф.АртикулЗамены;
        Стр.ДатаНачала          = Реф.ДатаНачала;
        Стр.ДатаЗавершения      = Реф.ДатаЗавершения;

        Стр.Записать(Истина);

    КонецЦикла;

    Статус("Изменения замен загружены", 100);

КонецПроцедуры

Процедура ОчиститьЗамены() Экспорт

    Статус("Очистка замен", 50);

    Тариф = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьНаборЗаписей();
    Тариф.Записать();

    Статус("Замены очищены", 100);

КонецПроцедуры


// Эквиваленты

Процедура ЗагрузитьЭквиваленты() Экспорт

    Статус("Получаем эквиваленты с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьВсеЭквивалентыССервера();

    Если ЗаписыватьНаборами Тогда

        НаборЗаписей = РегистрыСведений.Renault_ЭквивалентыРеферансов.СоздатьНаборЗаписей();
        Счетчик = 0;
        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Читаем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли


            Счетчик = Счетчик + 1;
            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Стр = НаборЗаписей.Добавить();
            Стр.Артикул            = Реф.Артикул;
            Стр.АртикулЭквивалента = Реф.АртикулЭквивалента;

            Если Счетчик >= КоличествоОбъектов Тогда
                Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
                НаборЗаписей.Записать(Ложь);
                НаборЗаписей = РегистрыСведений.Renault_ЭквивалентыРеферансов.СоздатьНаборЗаписей();
                Счетчик = 0;
                Статус("Читаем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
            КонецЕсли;

        КонецЦикла;

        Статус("Записываем данные", 100 * ГлобальныйСчетчик / ВсегоЗаписей);
        НаборЗаписей.Записать(Ложь);

    Иначе

        ГлобальныйСчетчик = 0;
        ВсегоЗаписей = Таблица.Количество();

        Статус("Записываем данные");

        Для Каждого Реф Из Таблица Цикл

            #Если Клиент Тогда
                ОбработкаПрерыванияПользователя();
            #КонецЕсли

            ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
            Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

            Стр = РегистрыСведений.Renault_ЭквивалентыРеферансов.СоздатьМенеджерЗаписи();
            Стр.Артикул            = Реф.Артикул;
            Стр.АртикулЭквивалента = Реф.АртикулЭквивалента;

            Стр.Записать(Истина);

        КонецЦикла;

    КонецЕсли;

    Статус("Эквиваленты загружены", 100);

КонецПроцедуры

Процедура ОчиститьЭквиваленты() Экспорт

    Статус("Очистка эквивалентов", 50);

    Тариф = РегистрыСведений.Renault_ЭквивалентыРеферансов.СоздатьНаборЗаписей();
    Тариф.Записать();

    Статус("Эквиваленты очищены", 100);

КонецПроцедуры


// Статусы номенклатуры

Процедура ЗагрузитьСтатусы() Экспорт

    Статус("Получаем статусы с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьВсеСтатусыССервера();

    ГлобальныйСчетчик = 0;
    ВсегоЗаписей = Таблица.Количество();

    Статус("Записываем данные");

    Для Каждого Реф Из Таблица Цикл

        #Если Клиент Тогда
            ОбработкаПрерыванияПользователя();
        #КонецЕсли

        ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
        Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

        
        Ном = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Реф.Артикул);
        Если ЗначениеЗаполнено(Ном) Тогда
            Стр = РегистрыСведений.Renault_СтатусыНоменклатуры.СоздатьМенеджерЗаписи();
            Стр.Номенклатура = Ном;
            Стр.Прочитать();
			Если Не Стр.НеОбновлять Тогда
				Стр.Номенклатура   = Ном;
                Стр.Статус         = Справочники.Renault_СтатусыНоменклатуры.НайтиПоКоду(Реф.Статус);
                Стр.ДатаОбновления = Реф.Период;
                Стр.Записать(Истина);
            КонецЕсли;
        КонецЕсли;

    КонецЦикла;

    Статус("Статусы загружены", 100);

КонецПроцедуры

Процедура ОбновитьСтатусы(Интервал) Экспорт

    Статус("Получаем изменения статусов с сервера");

    Таблица = Renault_ЗапчастиСервер.ПолучитьИзмененияСтатусовССервера(Интервал);

    ГлобальныйСчетчик = 0;
    ВсегоЗаписей = Таблица.Количество();

    Статус("Записываем данные");

    Для Каждого Реф Из Таблица Цикл

        #Если Клиент Тогда
            ОбработкаПрерыванияПользователя();
        #КонецЕсли

        ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
        Статус(,100 * ГлобальныйСчетчик / ВсегоЗаписей);

        Ном = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Реф.Артикул);
        Если ЗначениеЗаполнено(Ном) Тогда
            Стр = РегистрыСведений.Renault_СтатусыНоменклатуры.СоздатьМенеджерЗаписи();
            Стр.Номенклатура = Ном;
            Стр.Прочитать();
            Если Не Стр.НеОбновлять Тогда
                Стр.Номенклатура = Ном;
                Стр.Статус = Справочники.Renault_СтатусыНоменклатуры.НайтиПоКоду(Реф.Статус);
                Стр.ДатаОбновления = Реф.Период;
                Стр.Записать(Истина);
            КонецЕсли;
        КонецЕсли;

    КонецЦикла;

    Статус("Изменения статусов загружены", 100);

КонецПроцедуры

Процедура ОчиститьСтатусы() Экспорт

    Статус("Очистка статусов", 50);

    Тариф = РегистрыСведений.Renault_СтатусыНоменклатуры.СоздатьНаборЗаписей();
    Тариф.Записать();

    Статус("Статусы очищены", 100);

КонецПроцедуры


Процедура ЗагрузитьСтатусыНоменклатуры() Экспорт

    Статус("Получаем статусы номенклатуры с сервера");

    Запрос="ВЫБРАТЬ
           |    ТЗ.Артикул КАК Артикул,
           |    ТЗ.Статус КАК Статус
           |ПОМЕСТИТЬ ТЗ
           |ИЗ
           |    &ТЗ КАК ТЗ
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |    &Период КАК Период,
           |    ЕСТЬNULL(Рег.Номенклатура, Записи.Номенклатура) КАК Номенклатура,
           |    ВЫБОР
           |        КОГДА ЕСТЬNULL(Рег.НеОбновлять, ЛОЖЬ)
           |            ТОГДА Рег.Статус
           |        ИНАЧЕ Записи.Статус
           |    КОНЕЦ КАК Статус,
           |    ЕСТЬNULL(Рег.НеОбновлять, ЛОЖЬ) КАК НеОбновлять
           |ИЗ
           |    РегистрСведений.Renault_СтатусыНоменклатуры.СрезПоследних(, ) КАК Рег
           |        ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
           |            Ном.Ссылка КАК Номенклатура,
           |            Ст.Ссылка КАК Статус
           |        ИЗ
           |            ТЗ КАК ТЗ
           |                ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
           |                ПО ТЗ.Артикул = Ном.Артикул
           |                ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СтатусыНоменклатуры КАК Ст
           |                ПО ТЗ.Статус = Ст.Ссылка.Код) КАК Записи
           |        ПО Рег.Номенклатура = Записи.Номенклатура";
    Запрос = Новый Запрос(Запрос);
    //Запрос.УстановитьПараметр("ТЗ", ПолучитьСтатусыНоменклатурыССервера());
    Запрос.УстановитьПараметр("Период", ТекущаяДата());
    Записи = РегистрыСведений.Renault_СтатусыНоменклатуры.СоздатьНаборЗаписей();
    Записи.Загрузить(Запрос.Выполнить().Выгрузить());
    Записи.Записать();

    Статус("Статусы номенклатуры загружены");

КонецПроцедуры


// ШИФРОВАНИЕ //////////////////////////////////////////////////////////////////
//
Функция GetUSBKeyComponentLocation()

    Перем Постфикс;
    СистемнаяИнформация = Новый СистемнаяИнформация;

    Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 тогда
        Постфикс = "Win32";
    ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 тогда
        Постфикс = "Win64";
    КонецЕсли;

    Макет = ПолучитьОбщийМакет("КомпонентаЗащиты_Guardant_" + Постфикс);
    Если Макет = Неопределено тогда
        ВызватьИсключение("Макет с образом компоненты защиты не найден");
    КонецЕсли;

    Возврат Макет.ПолноеИмя();

КонецФункции
////////////////////////////////////////////////////////////////////////////////


Настройки = Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза;
BIR               = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
PCLПродажа        = Настройки.ТипЦенPCL;
PNCЗакупСкладская = Настройки.ТипЦенPNC;
PNCЗакупСрочная   = Настройки.ТипЦенPNCU;
ДнейИзменения     = 1;

Форма = Неопределено; // Поддержка интерактивности
